In [1]:
import numpy as np
import pandas as pd

In [2]:
values = [10,20,30]
A = pd.Series(values)
A

0    10
1    20
2    30
dtype: int64

In [3]:
labels = ['First', 'Second', 'Third']
B = pd.Series(values, labels)
B

First     10
Second    20
Third     30
dtype: int64

In [4]:
array = np.arange(10, 31, 10)
array

array([10, 20, 30])

In [5]:
type(array)

numpy.ndarray

In [6]:
C = pd.Series(array, labels)
C

First     10
Second    20
Third     30
dtype: int32

In [7]:
dic = {'First':10, 'Second':20, 'Thrid':30}
dic

{'First': 10, 'Second': 20, 'Thrid': 30}

In [8]:
D = pd.Series(dic)
D

First     10
Second    20
Thrid     30
dtype: int64

In [9]:
E = pd.Series(labels, values)
E

10     First
20    Second
30     Third
dtype: object

In [10]:
countries = pd.Series([1,2,3,4], ['USA', 'Britain', 'France', 'Germany'])
countries

USA        1
Britain    2
France     3
Germany    4
dtype: int64

In [11]:
countries['USA']

1

In [12]:
countries2 = pd.Series( ['USA', 'Britain', 'France', 'Germany'], [1,2,3,4])
countries2

1        USA
2    Britain
3     France
4    Germany
dtype: object

In [13]:
countries2[1]

'USA'

In [14]:
countries

USA        1
Britain    2
France     3
Germany    4
dtype: int64

In [15]:
double_countries = countries + countries
double_countries

USA        2
Britain    4
France     6
Germany    8
dtype: int64

In [16]:
double_countries2 = countries2 + countries2
double_countries2

1            USAUSA
2    BritainBritain
3      FranceFrance
4    GermanyGermany
dtype: object

In [18]:
countries3 = pd.Series([1,5,3,4], ['USA', 'USSS', 'France', 'Germany'])
countries3

USA        1
USSS       5
France     3
Germany    4
dtype: int64

In [19]:
mixed_countries = countries + countries3
mixed_countries

Britain    NaN
France     6.0
Germany    8.0
USA        2.0
USSS       NaN
dtype: float64

In [20]:
countries

USA        1
Britain    2
France     3
Germany    4
dtype: int64

In [24]:
df = pd.DataFrame([countries, countries, countries])
df

   USA  Britain  France  Germany
0    1        2       3        4
1    1        2       3        4
2    1        2       3        4

In [25]:
countries4 = pd.Series([5,1,3,4], ['USA', 'Britian', 'France', 'Germany'])
countries4

USA        5
Britian    1
France     3
Germany    4
dtype: int64

In [26]:
index = 'WWI WWII'.split()
index

['WWI', 'WWII']

In [27]:
new_df = pd.DataFrame([countries, countries4], index)
new_df

      Britain  Britian  France  Germany  USA
WWI       2.0      NaN     3.0      4.0  1.0
WWII      NaN      1.0     3.0      4.0  5.0

In [29]:
email = 'lillianc@princeton.edu'
string_list = email.split('.')
string_list

['lillianc@princeton', 'edu']

In [31]:
my_array = np.arange(1,21).reshape(5,4)
my_array

array([[ 1,  2,  3,  4],
       [ 5,  6,  7,  8],
       [ 9, 10, 11, 12],
       [13, 14, 15, 16],
       [17, 18, 19, 20]])

In [32]:
row_labels = 'A B C D E'.split()
row_labels

['A', 'B', 'C', 'D', 'E']

In [33]:
col_labels = 'odd1 even1 odd2 even2'.split()
col_labels

['odd1', 'even1', 'odd2', 'even2']

In [34]:
df_array = pd.DataFrame(my_array, row_labels, col_labels)
df_array

   odd1  even1  odd2  even2
A     1      2     3      4
B     5      6     7      8
C     9     10    11     12
D    13     14    15     16
E    17     18    19     20

In [39]:
df_array[['odd1','even2']]

   odd1  even2
A     1      4
B     5      8
C     9     12
D    13     16
E    17     20

In [40]:
df_array['odd2']['D']

15

In [52]:
df_array.loc['A'][:]

odd1     1
even1    2
odd2     3
even2    4
Name: A, dtype: int32

In [53]:
df_array

   odd1  even1  odd2  even2
A     1      2     3      4
B     5      6     7      8
C     9     10    11     12
D    13     14    15     16
E    17     18    19     20

In [55]:
df_array['Odd Sum'] = df_array['odd1'] + df_array['odd2']
df_array['Even Sum'] = df_array['even1'] + df_array['even2']
df_array

   odd1  even1  odd2  even2  Odd Sum  Even Sum
A     1      2     3      4        4         6
B     5      6     7      8       12        14
C     9     10    11     12       20        22
D    13     14    15     16       28        30
E    17     18    19     20       36        38

In [56]:
df_array[df_array > 5]

   odd1  even1  odd2  even2  Odd Sum  Even Sum
A   NaN    NaN   NaN    NaN      NaN         6
B   NaN    6.0   7.0    8.0     12.0        14
C   9.0   10.0  11.0   12.0     20.0        22
D  13.0   14.0  15.0   16.0     28.0        30
E  17.0   18.0  19.0   20.0     36.0        38

In [57]:
df_array

   odd1  even1  odd2  even2  Odd Sum  Even Sum
A     1      2     3      4        4         6
B     5      6     7      8       12        14
C     9     10    11     12       20        22
D    13     14    15     16       28        30
E    17     18    19     20       36        38

In [68]:
df_array[(df_array['odd1'] != 13) & (df_array['odd1'] != 17)]

   odd1  even1  odd2  even2  Odd Sum  Even Sum
A     1      2     3      4        4         6
B     5      6     7      8       12        14
C     9     10    11     12       20        22

In [70]:
dic = {'X':[1,2,np.nan], 'Y':[4,np.nan,np.nan], 'Z': [7,8,9]}
dic

{'X': [1, 2, nan], 'Y': [4, nan, nan], 'Z': [7, 8, 9]}

In [71]:
row_labels = 'A B C'.split()
row_labels

['A', 'B', 'C']

In [72]:
df = pd.DataFrame(dic,row_labels)
df

     X    Y  Z
A  1.0  4.0  7
B  2.0  NaN  8
C  NaN  NaN  9

In [80]:
df.dropna(thresh=3)

     X    Y  Z
A  1.0  4.0  7

In [81]:
df

     X    Y  Z
A  1.0  4.0  7
B  2.0  NaN  8
C  NaN  NaN  9

In [82]:
df.fillna('X')

   X  Y  Z
A  1  4  7
B  2  X  8
C  X  X  9

In [85]:
year_var = df['X']
year_var

A    1.0
B    2.0
C    NaN
Name: X, dtype: float64

In [86]:
xcol_mean = year_var.mean()
xcol_mean

1.5

In [87]:
year_var.fillna(value=xcol_mean)

A    1.0
B    2.0
C    1.5
Name: X, dtype: float64

In [88]:
df

     X    Y  Z
A  1.0  4.0  7
B  2.0  NaN  8
C  NaN  NaN  9

In [89]:
df['X'].fillna(value=df['X'].mean())

A    1.0
B    2.0
C    1.5
Name: X, dtype: float64

In [91]:
for i in 'X Y Z'.split():
    df[i].fillna(value=df[i].mean(), inplace=True)
df

     X    Y  Z
A  1.0  4.0  7
B  2.0  4.0  8
C  1.5  4.0  9

In [92]:
data = {'Sales Person': 'Sam Charlie Amy Vanessa Carl Sarah'.split(), 
       'Product': "Hp Hp Apple Apple Dell Dell".split(),
       'Sales':[200,120,340,124,243,350]}
data

{'Product': ['Hp', 'Hp', 'Apple', 'Apple', 'Dell', 'Dell'],
 'Sales': [200, 120, 340, 124, 243, 350],
 'Sales Person': ['Sam', 'Charlie', 'Amy', 'Vanessa', 'Carl', 'Sarah']}

In [93]:
row_labels = list(range(1,7))
row_labels

[1, 2, 3, 4, 5, 6]

In [94]:
df = pd.DataFrame(data, row_labels)
df

  Product  Sales Sales Person
1      Hp    200          Sam
2      Hp    120      Charlie
3   Apple    340          Amy
4   Apple    124      Vanessa
5    Dell    243         Carl
6    Dell    350        Sarah

In [95]:
df.groupby('Product').sum()

         Sales
Product
Apple      464
Dell       593
Hp         320

In [96]:
df.groupby('Product').count()

         Sales  Sales Person
Product
Apple        2             2
Dell         2             2
Hp           2             2

In [97]:
df.groupby('Product').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Product
Apple     2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0
Dell      2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
Hp        2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0